package com.am.mdrr.entity;

import java.util.List;

/**
 * Created by AM on 2016/6/28.
 */
public  class ShowapiResBodyBean {


    /**
     * allPages : 1521
     * ret_code : 0
     * contentlist : [{"id":"577332d46e36bed73a4c5d92","title":"醒了很久了，看着室友","text":"醒了很久了，看着室友们都睡得很香，生怕吵醒他们，连出门都小心翼翼的！ 回头看了看他们，哎，算了，还是快走吧，不然赶不上考试了。","type":1,"ct":"2016-06-29 10:30:44.377"},{"id":"57732ba66e36bed73a4c377f","title":"女子：\u201c医生，你让我","text":"女子：\u201c医生，你让我把舌头伸出来，怎么又不看呢？\u201d 医生：\u201c我不是要看你的舌头，而是要你在我开药方时安静点。\u201d","type":1,"ct":"2016-06-29 10:00:06.978"},{"id":"577324d06e36bed73a4c25de","title":"手机突然响了，他拿起","text":"手机突然响了，他拿起一看，是ex发来的。 轻轻划开锁屏，上面写着：\u201c和闺蜜们聊天，提到你，突然想你了。\u201d 他不禁一阵感动，回复道：\u201c提到我什么了？\u201d 一会儿ex回道：\u201c聊到谁最小，大家异口同声说你。\u201d","type":1,"ct":"2016-06-29 09:30:56.019"},{"id":"57729f226e36bed73a49d7da","text":"甲:七夕刚过，你送妻子什么花了？乙:牡丹，我心中的女王！甲:那要是母亲节，你送你母亲什么？乙:康乃馨，母爱温馨！甲:嘿嘿，那你的情人呢？乙:玫瑰，我喜欢带刺的缠绵！甲:哈哈，那要是情敌呢？乙:情敌？上帝会喜欢他的，天花！","title":"七夕刚过，你送妻子什么花了？","type":1,"ct":"2016-06-29 00:00:34.794"},{"id":"57729f226e36bed73a49d7d9","text":"蚂蚁姑娘和大象公子是好邻居也是好同学，他们非常珍惜这段从小到大的友谊，互相帮助。一天放学回家，蚂蚁被几个牛蛮拦住调戏，大象看见了便跟他们打了起来，最终牛蛮被赶跑了可大象的脚也擦破了皮。蚂蚁姑娘含着泪对大象公子说:\u201c快，快去医院，看你这都血流成河了！\u201d","title":"蚂蚁姑娘和大象公子是好邻居也是好同学","type":1,"ct":"2016-06-29 00:00:34.794"},{"id":"57729f226e36bed73a49d7d8","text":"赤壁之战后，《三国小报》记者独家采访了曹操，披露了关于赤壁之战曹操失败的真正原因。问：您作为一代军事家、政治家兼诗人，怎么会没想到防止敌人用火攻？曹操：唉，其实历史的真相根本不是像罗贯中小子写的那样。问：那您能否简单谈一下当时的真实情况。曹操：当时我军士兵中患病的很多，几个小子因为感到冷，就在船上点火取暖，结果引发了大火，其实那火根本不是孙权和刘备联军放的，他两的智商加一块也不是我的个，怎么能烧到我呢？问：那您对此事有何感想？曹操：隐患大于明火，防范重于泰山啊！","title":"赤壁之战后，《三国小报》记者独家采访了曹","type":1,"ct":"2016-06-29 00:00:34.794"},{"id":"57729f226e36bed73a49d7d7","text":"一个苍蝇落在了丈夫的光头上，妻子扑哧的笑了，丈夫感到莫名其妙的问妻子笑什么？妻子说：一只苍蝇落在了你的光头上，你猜我想起了什么？丈夫摸着铮亮的光头问想起了什么？妻子说：我想到了苍蝇不叮无逢的蛋！","title":"一个苍蝇落在了丈夫的光头上","type":1,"ct":"2016-06-29 00:00:34.794"},{"id":"57729f226e36bed73a49d7d6","text":"（A君躺在车上睡觉）孕妇：（把他推醒）请往边上坐，给我腾个位置。A君：（不满）没看见我在睡觉吗？孕妇：你只买了一个人的票，凭啥占两个座位？A君：（看了孕妇一眼）你不也是买一张票，两人一起上来了","title":"请往边上坐，给我腾个位置","type":1,"ct":"2016-06-29 00:00:34.794"},{"id":"577298236e36bed73a49c304","text":"有次电信打电话来家里，向奶奶推销宽带。说订一年的宽带还送个猫。奶奶说家里养了狗了，没法养猫。","title":"有次电信打电话来家里","type":1,"ct":"2016-06-28 23:30:43.551"},{"id":"577298236e36bed73a49c303","text":"常听大家说当红的这些年轻演员如何如何没演技，但畅想一下，如果我们能拿出田忌赛马的精神，让刘诗诗去演一个盲人，让张艺兴去演一个智障，让杨幂和唐嫣去演两个表面上相亲相爱背后互相捅刀的绿茶婊，让鹿晗去演一个女同性恋（P），我们会得到多少优秀的影视作品啊！大家说是不是！","title":"常听大家说当红的这些年轻演员如何如何没演","type":1,"ct":"2016-06-28 23:30:43.550"},{"id":"577298236e36bed73a49c302","text":"陪爷爷聊天：爷，你有让你记恨的人么？爷爷：没有。我：您的心胸好宽阔。爷爷：不是我心胸宽，是他们都活得没我久。我：...","title":"爷，你有让你记恨的人么？","type":1,"ct":"2016-06-28 23:30:43.549"},{"id":"577298236e36bed73a49c301","text":"有一个多次在大巴车上实施抢劫的罪犯在法庭上受审。法官：这位被告，公诉机关指控你在客车上用暴力、控吓等不正当手段强行夺取他人钱财，你可知道你的行为已构成什么犯罪行为？罪犯：知道。法官：什么罪？罪犯：乱收费。","title":"有一个多次在大巴车上实施抢劫的罪犯在法庭","type":1,"ct":"2016-06-28 23:30:43.538"},{"id":"577298236e36bed73a49c2f5","text":"某夫妻俩，老公是个急性子，老婆是个慢性子。一日，夫妻俩外出买菜。老公看时间快到中午了，赶紧拉着妻子往回赶。回到家后才发现，光顾着买菜了却忘了拿！老公十分气愤地对老婆说：\u201c你怎么不告诉我一声！\u201d只见老婆缓缓答道：\u201c你买那么快！我反应得过来吗？\u201d又一日，老公在水井打水的时候一失足掉到水井里。当众人听到丈夫的呼救声赶来的时候却看见，慢性子的老婆坐在水井边，众人不解问道：\u201c你为啥不救你老公？\u201d慢性子老婆回答道：\u201c急什么？没看到我在搓绳子救他吗？\u201d","title":"某夫妻俩，老公是个急性子，老婆是个慢性子","type":1,"ct":"2016-06-28 23:30:43.372"},{"id":"577298236e36bed73a49c2f3","text":"一个女人看病。<\/p><p>医生:您怎么了，女士？<\/p><p>女人:我一天到晚总是感觉浑身无力。<\/p><p>医生做了综合的检查，发现没有任何疾病。于是， 医生:你的夫妻生活的频率是多少？<\/p><p>女人:星期一，星期三和星期天。<\/p><p>医生:这有点频繁了，建议你去掉星期三的。<\/p><p>女人:不行啊医生，只有那晚我才和老公在一起。","title":"一个女人看病","type":1,"ct":"2016-06-28 23:30:43.371"},{"id":"577298236e36bed73a49c2f2","text":"张先生买了一套房子，是在顶楼。他的妻子埋怨楼层太高。他说：\u201c买高层楼房有好处。\u201d他的妻子说：\u201c我看只有害处，连说话都要小声，不敢高声语，恐惊天上不人。\u201d他说：\u201c我给你讲高层楼房的意义，一，从政治上来说，顶层就是上层建筑，以后，我们有前途。二，从经济上来说，跳楼价总是从顶层开始，我们会有优惠待遇。三，从文学上来说，欲穷千里目，更上一层楼，我们在顶层，谁能比我们看得远呀。四，从体育运动来说，每天爬楼梯就是锻炼身体。五，从教育上来说，每次回家就是教育孩子：世上无难事，只要肯攀登。\u201d","title":"张先生买了一套房子，是在顶楼","type":1,"ct":"2016-06-28 23:30:43.371"},{"id":"577298236e36bed73a49c2f1","text":"小张第一次去小李家做客，他与小李夫妻俩围在一张圆桌子上吃饭，吃饭时一阵安静，为了打破，小张说道：李夫人做的面真好吃。 李夫人说道：哈哈，这是在商店买的速冻食品。 小张接道：那李夫人真会买东西。李夫人说：是我让是老公买的。 小张说道：李夫人真会管理人。","title":"小张第一次去小李家做客","type":1,"ct":"2016-06-28 23:30:43.371"},{"id":"577298236e36bed73a49c2f0","text":"有一个老人喜欢到湖边跟着一群人钓鱼。有一天，他还是去钓鱼，钓到一只很大的鱼，他毫不犹豫的放回湖里。钓到一只小小的鱼，他喜笑颜开的放进带来的桶里。别人很费解，于是一个人问他：老爷爷，你为什么只钓小鱼，而钓到大鱼反而放回湖里？ 老人笑了一笑，说：不好意思，我家的锅小。","title":"有一个老人喜欢到湖边跟着一群人钓鱼","type":1,"ct":"2016-06-28 23:30:43.370"},{"id":"577290f56e36bed73a4999d6","text":"朋友的老婆是老师，星期六早上有课，上班前交代老公在家洗衣服。课间给老公打电话问衣服洗好了没，她老公说家里停电了，衣服没法洗了，然后他老婆问那你在家干嘛呢，这二货的回答居然是看电视呢。","title":"朋友的老婆是老师，星期六早上有课","type":1,"ct":"2016-06-28 23:00:05.334"},{"id":"577290f56e36bed73a4999d5","text":"女：\u201c不要盯着我看好不好？\u201d男：\u201c为什么？\u201d女：\u201c因为，看到你，我就会恶心呕吐！\u201d男：\u201c没想到我的魅力挺大的，看你一眼，你就怀孕了！\u201d","title":"不要盯着我看好不好？","type":1,"ct":"2016-06-28 23:00:05.331"},{"id":"577290f56e36bed73a4999d4","text":"\u201c老公，你看我像什么？\u201d\u201c象这杯红酒。\u201d\u201c咯咯。芳香无比，回味无穷喽？\u201d\u201c喝下去了，才明白：这钱，花得太不值了！\u201d","title":"老公，你看我像什么","type":1,"ct":"2016-06-28 23:00:05.331"}]
     * currentPage : 1
     * allNum : 30419
     * maxResult : 20
     */

    private int allPages;
    private int ret_code;
    private int currentPage;
    private int allNum;
    private int maxResult;
    /**
     * id : 577332d46e36bed73a4c5d92
     * title : 醒了很久了，看着室友
     * text : 醒了很久了，看着室友们都睡得很香，生怕吵醒他们，连出门都小心翼翼的！ 回头看了看他们，哎，算了，还是快走吧，不然赶不上考试了。
     * type : 1
     * ct : 2016-06-29 10:30:44.377
     */

    private List<ContentlistBean> contentlist;

    public int getAllPages() {
        return allPages;
    }

    public void setAllPages(int allPages) {
        this.allPages = allPages;
    }

    public int getRet_code() {
        return ret_code;
    }

    public void setRet_code(int ret_code) {
        this.ret_code = ret_code;
    }

    public int getCurrentPage() {
        return currentPage;
    }

    public void setCurrentPage(int currentPage) {
        this.currentPage = currentPage;
    }

    public int getAllNum() {
        return allNum;
    }

    public void setAllNum(int allNum) {
        this.allNum = allNum;
    }

    public int getMaxResult() {
        return maxResult;
    }

    public void setMaxResult(int maxResult) {
        this.maxResult = maxResult;
    }

    public List<ContentlistBean> getContentlist() {
        return contentlist;
    }

    public void setContentlist(List<ContentlistBean> contentlist) {
        this.contentlist = contentlist;
    }


}
